# WireSetIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireSetIterator Class
Members See Also
---
An iterator to a set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class WireSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class WireSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class WireSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..WireSetIterator
# See Also
WireSetIterator Members
Autodesk.Revit.DB.Electrical Namespace